{
	"Title": "Welcome.",
	"Subtitle": "varyo's tech blog",
	"posts": [
		{
			"Author": "varyo",
			"Date": "10th Oct. 2013",
			"Categories": "Juicy Linux",
            "Tags": "juicy, linux, arch, distribution, tutorial",
			"Title": "#1 Juicy Linux - Introduction",
			"Content": "In this series of articles I will record the process of developing an Arch Linux distribution. More precisely I will customize an Arch Linux installation step by step - system setup, desktop environment etc - and eventually share it as a Live system. The name of this project will be 'Juicy Linux' ;)<br/><br/>For more information about Arch Linux I suggest to you the following sites: <ul class='square'><li><a href='https://www.archlinux.org/'>Arch Linux main site</a></li><li><a href='https://wiki.archlinux.org/'>Excellent Arch Linux Wiki</a> with its</li><li>really helpful <a href='https://wiki.archlinux.org/index.php/Beginners%27_Guide'>Beginner's Guide</a></li></ul>So why am I doing this? And what are the goals of this project? I think there are several answers to that question. On the one hand I need a substitute to my current Mac OSX system. My MacBook Pro is over four years old and it's time to get a new laptop. But as you know Apple products are not always the cheapest. And so I decided to buy just a standard laptop and install Linux. However I want to customize it to fit my needs: that is the look & feel of OSX. But the emphasize is on 'feel'. If it feels good who needs fancy skeuomorphisms? On the other hand I always wanted to create my own personal Linux that's got everything I need in my daily work.<br/><br/>So I thought I take this moment as a chance to do so and share this process with you and maybe discuss about relevant and irrelevant features of a daily-use Linux distribution.<br/><br/>Enough talking - let's get started! The installation of Arch can be a bit tricky for beginners while there is no graphical installer like it's in Ubuntu e.g. But there is the Arch Wiki and hundreds of guides out there that help you with the setup. I will continue the installation on a Virtual Machine for now. In later stages we will transfer the system to a real desktop pc/laptop and test it in the field. While you can follow the <a href='https://wiki.archlinux.org/index.php/Beginners%27_Guide'>Beginner's Guide</a> to get your system up - I will present you my command history in a short form (it wouldn't make sense to go into details here - that has already be done a hundred times ;). <pre>loadkeys en # english keyboard layout (by default) - change it to your needs<br/>dhcpcd # establish internet connection<br/>gdisk /dev/sda # partition the only hard disk<br/># we will use grub2 as a bootloader, so the disk layout is as follows:<br/># - grub: +2M, type EF02<br/># - boot: +100M, type 0800<br/># - root: ..., type 0800<br/># I won't initialize a swap partition - but you can of course!<br/>mkfs.ext2 /dev/sda2 # boot partition<br/>mkfs.ext4 /dev/sda3 # root<br/>mount /dev/sda3 /mnt # mount our disks<br/>mkdir /mnt/boot<br/>mount /dev/sda2 /mnt/boot<br/># install all neccessary packages - maybe you don't need the wifi stuff (wpa_supplicant)<br/>pacstrap -i /mnt base base-devel wpa_supplicant grub-bios<br/>genfstab -p /mnt >> /mnt/etc/fstab<br/># dive into the new system<br/>arch-chroot /mnt<br/>passwd # set root password<br/>echo 'juicy' > /etc/hostname # set hostname to 'juicy' or whatever you like<br/>echo 'KEYMAP=en' > /etc/vconsole.conf # set default keymap for the next boot<br/>ln -s /usr/share/zoneinfo/Europe/Amsterdam /etc/localtime # setup your time zone<br/># optional todo now: setup locales - I will skip this<br/>hwclock --systohc --utc<br/>mkinitcpio -p linux # create ramdisk<br/>grub-install /dev/sda # bootload installation: be sure to select the whole disc!<br/>grub-mkconfig -o /boot/grub/grub.cfg<br/>exit # leave chroot<br/>umount /mnt/boot /mnt # clean up<br/>reboot # done!</pre>This is mostly taken from this <a href='https://gist.github.com/alphazo/3285090'>gist</a>. Note: my installation system is 32 bit (x86). If you chose a 64 bit system (x86_64) see <a href='https://wiki.archlinux.org/index.php/multilib'>this</a> guide to enable multilib support.<br/>Now that the minimal system is set up we can start installing some additional software. Before we proceed make sure that your VM system has 3D hardware acceleration enabled. Otherwise you will end up with lags in your desktop environment most likely. To enable OpenGL support first install mesa.<pre>pacman -S mesa-libgl mesa</pre>Before we will install the graphics drivers we will bring up some essential services (daemons) for our system. This is not mandatory. Feel free to choose on your own which ones you would like to enable. Before we can activate them we have to install their packages.<pre>pacman -S acpid # not only for laptops: power management<br/>pacman -S ntp # synchronize your system clock with the ntp daemon<br/>pacman -S avahi # zeroconf network communication system which can e.g. detect your network printers<br/>pacman -S cups # cups printer service</pre>Now we can finally bring them up. <pre>systemctl enable dhcpcd.service # dhcp daemon <br/>systemctl enable cronie # for cronjobs <br/>systemctl enable acpid <br/>systemctl enable ntpd<br/>systemctl enable avahi-daemon<br/>systemctl enable cups</pre>By enabling this services we make sure that they will be started automatically on the next boot. In the last step for this time we will care about the trackpad driver to enable the touchpad mouse on laptops. <pre>pacman -S xf86-input-synaptics</pre>In the next section we will talk about the design and specification of the system and begin with some simple but neccessary configurations. Stay tuned!"
		},
		{
			"Author": "varyo",
			"Date": "11th Oct. 2013",
			"Categories": "Juicy Linux",
            "Tags": "juicy, linux, arch, distribution, tutorial",
			"Title": "#2 Juicy Linux - Setting up a Desktop Environment",
			"Content": "- - - ",
			"tempContent": "Next we will install the open-source graphics drivers for ATI, nVidia and Intel. Optionally you can install the proprietary drivers (<a href='https://wiki.archlinux.de/title/Nvidia'>nVidia</a>, <a href='https://wiki.archlinux.de/title/ATI'>ATI</a>).<pre>pacman -S xf86-video-vesa xf86-video-ati xf86-video-intel xf86-video-nouveau xf86-video-nv</pre>The Arch Wiki says that you have to install the following packages if you have a x86_64 system. Otherwise you can skip this step. <pre>pacman -S lib32-ati-dri lib32-intel-dri lib32-nouveau-dri</pre> "
		}
	]
}
